Pandas</p>

pandas is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python.

pandas build upon numpy and scipy providing easy-to-use data structures and data manipulation functions with integrated indexing.

The main data structures pandas provides are Series and DataFrames. After a brief introduction to these two data structures and data ingestion, the key features of pandas this notebook covers are:

Generating descriptive statistics on data
Data cleaning using built in pandas functions
Frequent data operations for subsetting, filtering, insertion, deletion and aggregation of data
Merging multiple datasets using dataframes
Working with timestamps and time-series data

In [1]:
import pandas as pd

In [2]:
ser = pd.Series(data=[100, 200, 300, 400, 500], index=['tom', 'bob', 'nancy','dan', 'eric' ])

In [3]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [5]:
ser['nancy']

300

In [6]:
ser[[4, 3, 1]]

eric    500
dan     400
bob     200
dtype: int64

In [7]:
'bob' in ser

True

In [8]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [9]:
ser * 2

tom       200
bob       400
nancy     600
dan       800
eric     1000
dtype: int64

In [10]:
ser ** 2

tom       10000
bob       40000
nancy     90000
dan      160000
eric     250000
dtype: int64

In [11]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [12]:
df = pd.DataFrame(d)
print(df)

          one    two
apple   100.0  111.0
ball    200.0  222.0
cerill    NaN  333.0
clock   300.0    NaN
dancy     NaN  444.0

In [13]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [14]:
df.columns

Index(['one', 'two'], dtype='object')

In [15]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one    two
dancy    NaN  444.0
ball   200.0  222.0
apple  100.0  111.0

In [16]:
pd.DataFrame(d, index=['cerill'])

        one    two
cerill  NaN  333.0

In [17]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'],columns=['two', 'five'])

         two five
dancy  444.0  NaN
ball   222.0  NaN
apple  111.0  NaN

In [18]:
data=[{'a':1,'b':2},{'z':100,'apple':200,'red':300}]
pd.DataFrame(data)

     a    b      z  apple    red
0  1.0  2.0    NaN    NaN    NaN
1  NaN  NaN  100.0  200.0  300.0

In [19]:
data = [{'alex':1, 'joe':2},{'ema':5,'dore':10,'alice':20}]

In [20]:
pd.DataFrame(data)

   alex  joe  ema  dore  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [21]:
pd.DataFrame(data, index=['orange','red'])

        alex  joe  ema  dore  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [22]:
pd.DataFrame(data, columns=['joe','dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN   NaN   20.0

In [23]:
data=[{'p':1,'q':2},{'r':500,'aaa':600,'bbb':700}]
pd.DataFrame(data)

     p    q      r    aaa    bbb
0  1.0  2.0    NaN    NaN    NaN
1  NaN  NaN  500.0  600.0  700.0

In [24]:
df

          one    two
apple   100.0  111.0
ball    200.0  222.0
cerill    NaN  333.0
clock   300.0    NaN
dancy     NaN  444.0

In [25]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [26]:
df['two']

apple     111.0
ball      222.0
cerill    333.0
clock       NaN
dancy     444.0
Name: two, dtype: float64

In [27]:
df['three']=df['one']*df['two']
df

          one    two    three
apple   100.0  111.0  11100.0
ball    200.0  222.0  44400.0
cerill    NaN  333.0      NaN
clock   300.0    NaN      NaN
dancy     NaN  444.0      NaN

In [28]:
df['flag']=df['one']>250
df

          one    two    three   flag
apple   100.0  111.0  11100.0  False
ball    200.0  222.0  44400.0  False
cerill    NaN  333.0      NaN  False
clock   300.0    NaN      NaN   True
dancy     NaN  444.0      NaN  False

In [29]:
three = df.pop('three')

In [30]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [31]:
df

          one    two   flag
apple   100.0  111.0  False
ball    200.0  222.0  False
cerill    NaN  333.0  False
clock   300.0    NaN   True
dancy     NaN  444.0  False

In [32]:
del df['two']

In [33]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [34]:
df.insert(0, 'copy_of_one', df['one'])
df

        copy_of_one    one   flag
apple         100.0  100.0  False
ball          200.0  200.0  False
cerill          NaN    NaN  False
clock         300.0  300.0   True
dancy           NaN    NaN  False

In [35]:
df['one_upper_half'] = df['one'][:2]
df

        copy_of_one    one   flag  one_upper_half
apple         100.0  100.0  False           100.0
ball          200.0  200.0  False           200.0
cerill          NaN    NaN  False             NaN
clock         300.0  300.0   True             NaN
dancy           NaN    NaN  False             NaN

In [36]:
import pandas as pd
movies= pd.read_csv("D:\PYTHON\python2\movies.csv", sep=',')
print(type(movies))
movies.head(10)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [37]:
tags = pd.read_csv("D:/PYTHON/python2/tags.csv", sep=',')
tags.head()

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [38]:
ratings = pd.read_csv("D:/PYTHON/python2/ratings.csv", sep= ',')
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [39]:
del ratings['timestamp']
del tags['timestamp']

In [40]:
row_0 = tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [41]:
print(row_0)

userId           3
movieId        260
tag        classic
Name: 0, dtype: object

In [42]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

In [43]:
row_0['userId']

3

In [44]:
'ratings' in row_0

False

In [45]:
row_0.name

0

In [46]:
row_0 = row_0.rename('first_row')
row_0.name

'first_row'

In [47]:
print(row_0)

userId           3
movieId        260
tag        classic
Name: first_row, dtype: object

In [48]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [49]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [50]:
tags.iloc[[0,11,2000]]

      userId  movieId           tag
0          3      260       classic
11         4   164909        cliche
2000     647   164179  twist ending

In [51]:
ratings['rating'].describe()

count    2.500010e+07
mean     3.533854e+00
std      1.060744e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [52]:
ratings['rating'].mean()

3.533854451353085

In [53]:
ratings['rating'].min()

0.5

In [54]:
ratings['rating'].max()

5.0

In [55]:
ratings['rating'].std()

1.0607439610179747

In [56]:
ratings['rating'].mode()

0    4.0
Name: rating, dtype: float64

In [57]:
ratings.corr()

           userId   movieId    rating
userId   1.000000 -0.004413  0.001940
movieId -0.004413  1.000000 -0.009216
rating   0.001940 -0.009216  1.000000

In [58]:
filter_1 = ratings['rating'] > 5
filter_1.any()

False

In [59]:
filter_2 = ratings['rating'] > 0
filter_2.any()

True

In [60]:
movies.shape

(62423, 3)

In [61]:
movies.isnull().any()

movieId    False
title      False
genres     False
dtype: bool

In [62]:
ratings.shape

(25000095, 3)

In [63]:
ratings.isnull().any()

userId     False
movieId    False
rating     False
dtype: bool

In [64]:
tags.shape

(1093360, 3)

In [65]:
tags.isnull().any()

userId     False
movieId    False
tag         True
dtype: bool

In [66]:
tags = tags.dropna()

In [67]:
tags.isnull().any()

userId     False
movieId    False
tag        False
dtype: bool

In [68]:
tags.shape

(1093344, 3)

In [69]:
tags['tag'].head()

0             classic
1              sci-fi
2         dark comedy
3      great dialogue
4    so bad it's good
Name: tag, dtype: object

In [70]:
movies[['title','genres']].head()

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy

In [71]:
ratings[1000:1010]

      userId  movieId  rating
1000       4    45517     2.5
1001       4    45722     3.5
1002       4    46948     2.5
1003       4    46972     3.5
1004       4    48780     5.0
1005       4    48982     3.0
1006       4    49272     3.5
1007       4    49396     3.5
1008       4    49649     1.0
1009       4    50601     1.5

In [72]:
tag_counts = tags['tag'].value_counts()
tag_counts[:10]

sci-fi                8330
atmospheric           6516
action                5907
comedy                5702
surreal               5326
based on a book       5079
twist ending          4820
funny                 4738
visually appealing    4526
dystopia              4257
Name: tag, dtype: int64

In [73]:
is_highly_rated = ratings['rating'] >= 4
ratings[is_highly_rated][-5:]

          userId  movieId  rating
25000088  162541    41566     4.0
25000089  162541    45517     4.5
25000090  162541    50872     4.5
25000093  162541    58559     4.0
25000094  162541    63876     5.0

In [74]:
is_animation = movies['genres'].str.contains('Animation')
movies[is_animation][5:15]

,movieId,title,genres
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

In [75]:
movies[is_animation].head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

In [76]:
movies[is_animation].head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children
309,313,"Swan Princess, The (1994)",Animation|Children
359,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
387,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
545,551,"Nightmare Before Christmas, The (1993)",Animation|Children|Fantasy|Musical
551,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy
580,588,Aladdin (1992),Adventure|Animation|Children|Comedy|Musical
586,594,Snow White and the Seven Dwarfs (1937),Animation|Children|Drama|Fantasy|Musical
587,595,Beauty and the Beast (1991),Animation|Children|Fantasy|Musical|Romance|IMAX
588,596,Pinocchio (1940),Animation|Children|Fantasy|Musical
602,610,Heavy Metal (1981),Action|Adventure|Animation|Horror|Sci-Fi

In [77]:
ratings_count = ratings[['movieId', 'rating']].groupby('rating').count()
ratings_count

        movieId
rating
0.5      393068
1.0      776815
1.5      399490
2.0     1640868
2.5     1262797
3.0     4896928
3.5     3177318
4.0     6639798
4.5     2200539
5.0     3612474

In [78]:
average_rating = ratings[['movieId','rating']].groupby('movieId').mean()
average_rating.tail()

         rating
movieId
209157      1.5
209159      3.0
209163      4.5
209169      3.0
209171      3.0

In [79]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.head()

         rating
movieId
1         57309
2         24228
3         11804
4          2523
5         11714

In [80]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.tail()

         rating
movieId
209157        1
209159        1
209163        1
209169        1
209171        1

In [81]:
tags.head()

   userId  movieId               tag
0       3      260           classic
1       3      260            sci-fi
2       4     1732       dark comedy
3       4     1732    great dialogue
4       4     7569  so bad it's good

In [82]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [83]:
t = movies.merge(tags,on='movieId', how='inner')
t.shape

(1093344, 5)

In [84]:
t

,movieId,title,genres,userId,tag
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,791,Owned
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1048,imdb top 250
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1361,Pixar
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3164,Pixar
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3164,time travel
...,...,...,...,...,...
1093339,209063,The Prep School Negro (2012),(no genres listed),96399,Philadelphia
1093340,209063,The Prep School Negro (2012),(no genres listed),96399,private school
1093341,209063,The Prep School Negro (2012),(no genres listed),96399,quaker
1093342,209063,The Prep School Negro (2012),(no genres listed),96399,racism
1093343,209063,The Prep School Negro (2012),(no genres listed),96399,thought-provoking

In [85]:
f = movies.merge(tags, on='movieId', how='outer')
f.shape

(1110516, 5)

In [86]:
print("\U0001F923")

🤣

More examples: http://pandas.pydata.org/pandas-docs/stable/merging.html

In [87]:
avg_ratings = ratings.groupby('movieId',as_index=False).mean()
del avg_ratings['userId']
avg_ratings.head()

   movieId    rating
0        1  3.893708
1        2  3.251527
2        3  3.142028
3        4  2.853547
4        5  3.058434

In [88]:
box_office = movies.merge(avg_ratings, on='movieId', how='inner')
box_office.tail()

       movieId                           title                  genres  rating
59042   209157                       We (2018)                   Drama     1.5
59043   209159       Window of the Soul (2001)             Documentary     3.0
59044   209163                Bad Poems (2018)            Comedy|Drama     4.5
59045   209169             A Girl Thing (2001)      (no genres listed)     3.0
59046   209171  Women of Devil's Island (1962)  Action|Adventure|Drama     3.0

In [89]:
is_highly_rated = box_office['rating'] >= 4.0
box_office[is_highly_rated][-5:]

,movieId,title,genres,rating
59027,209121,Adrenalin: The BMW Touring Car Story (2014),Documentary,4.0
59028,209123,Square Roots: The Story of SpongeBob SquarePan...,Documentary,4.0
59029,209129,Destination Titan (2011),Documentary,4.5
59041,209155,Santosh Subramaniam (2008),Action|Comedy|Romance,5.0
59044,209163,Bad Poems (2018),Comedy|Drama,4.5

In [90]:
is_comedy = box_office['genres'].str.contains('Comedy')

box_office[is_comedy][:5]

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.893708
2,3,Grumpier Old Men (1995),Comedy|Romance,3.142028
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,2.853547
4,5,Father of the Bride Part II (1995),Comedy,3.058434
6,7,Sabrina (1995),Comedy|Romance,3.363666

In [91]:
box_office[is_comedy & is_highly_rated][-5:]

,movieId,title,genres,rating
58990,208911,Cheating in Chains (2006),Comedy,4.0000
58998,208939,Klaus (2019),Adventure|Animation|Children|Comedy,4.3125
59001,208945,Powder (2019),Comedy|Drama,4.5000
59041,209155,Santosh Subramaniam (2008),Action|Comedy|Romance,5.0000
59044,209163,Bad Poems (2018),Comedy|Drama,4.5000

In [92]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [93]:
movie_genres = movies['genres'].str.split('|',expand=True)

In [94]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None
5,Action,Crime,Thriller,None,None,None,None,None,None,None
6,Comedy,Romance,None,None,None,None,None,None,None,None
7,Adventure,Children,None,None,None,None,None,None,None,None
8,Action,None,None,None,None,None,None,None,None,None
9,Action,Adventure,Thriller,None,None,None,None,None,None,None

In [95]:
movie_genres['isComedy'] = movies['genres'].str.contains('Comedy')

In [96]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9,isComedy
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None,True
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None,False
2,Comedy,Romance,None,None,None,None,None,None,None,None,True
3,Comedy,Drama,Romance,None,None,None,None,None,None,None,True
4,Comedy,None,None,None,None,None,None,None,None,None,True
5,Action,Crime,Thriller,None,None,None,None,None,None,None,False
6,Comedy,Romance,None,None,None,None,None,None,None,None,True
7,Adventure,Children,None,None,None,None,None,None,None,None,False
8,Action,None,None,None,None,None,None,None,None,None,False
9,Action,Adventure,Thriller,None,None,None,None,None,None,None,False

In [97]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [98]:
movies['year'] = movies['title'].str.extract('.*\((.*)\).*',expand=True)

In [99]:
movies.tail()

       movieId                           title                  genres  year
62418   209157                       We (2018)                   Drama  2018
62419   209159       Window of the Soul (2001)             Documentary  2001
62420   209163                Bad Poems (2018)            Comedy|Drama  2018
62421   209169             A Girl Thing (2001)      (no genres listed)  2001
62422   209171  Women of Devil's Island (1962)  Action|Adventure|Drama  1962

In [100]:
tags = pd.read_csv('D:/PYTHON/python2/ratings.csv', sep=',')

In [101]:
tags.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [102]:
tags.head(5)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [103]:
tags['parsed_time'] = pd.to_datetime(tags['timestamp'],unit='s')

In [104]:
tags['parsed_time'].dtype

dtype('<M8[ns]')

In [105]:
tags.head(2)

   userId  movieId  rating   timestamp         parsed_time
0       1      296     5.0  1147880044 2006-05-17 15:34:04
1       1      306     3.5  1147868817 2006-05-17 12:26:57

In [106]:
greater_than_t = tags['parsed_time'] > '2015-02-01'

selected_rows = tags[greater_than_t]

tags.shape,selected_rows.shape

((25000095, 5), (7471657, 5))

In [107]:
tags.sort_values(by='parsed_time', ascending=True)[:10]

          userId  movieId  rating  timestamp         parsed_time
326761      2262       21     3.0  789652009 1995-01-09 11:46:49
326810      2262     1079     3.0  789652009 1995-01-09 11:46:49
326767      2262       47     5.0  789652009 1995-01-09 11:46:49
15845015  102689        1     4.0  822873600 1996-01-29 00:00:00
15845023  102689       39     5.0  822873600 1996-01-29 00:00:00
16940364  109832       32     4.0  822873600 1996-01-29 00:00:00
15845027  102689       47     5.0  822873600 1996-01-29 00:00:00
15845028  102689       50     5.0  822873600 1996-01-29 00:00:00
15845029  102689       52     4.0  822873600 1996-01-29 00:00:00
15845031  102689       58     5.0  822873600 1996-01-29 00:00:00

In [108]:
average_rating = ratings[['movieId','rating']].groupby('movieId',as_index=False).mean()
average_rating.tail()

       movieId  rating
59042   209157     1.5
59043   209159     3.0
59044   209163     4.5
59045   209169     3.0
59046   209171     3.0

In [109]:
joined = movies.merge(average_rating,on='movieId',how='inner')
joined.corr()

          movieId    rating
movieId  1.000000 -0.093459
rating  -0.093459  1.000000

In [110]:
yearly_average = joined[['year','rating']].groupby('year',as_index=False).mean()
yearly_average[:10]

   year    rating
0  1874  3.027778
1  1878  2.909091
2  1880  2.666667
3  1883  2.636364
4  1887  1.750000
5  1888  2.373042
6  1890  2.196667
7  1891  1.692842
8  1892  1.530769
9  1894  2.376825